api/app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Abdi"], ["email", "abdi@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-04-10 11:30:22.891024"], ["updated_at", "2023-04-10 11:30:22.891024"]]